rheoTool/tutorials/rheoInterFoam/damBreak/Newtonian/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
 
}

divSchemes
{
    default                  none;
   
    div(rhoPhi,U)            Gauss limitedLinearV 1;
    div(Sum(tau))            Gauss linear;
    div(phi,alpha)           Gauss vanLeer;
    div(phirb,alpha)         Gauss interfaceCompression;
    div(eta*alpha*dev2(T(gradU)))  Gauss linear;         
}

laplacianSchemes
{
    default                             Gauss linear corrected;
}

interpolationSchemes
{
    default        linear;      
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
